---
kind: other
id: Methods.T:Autodesk.Revit.DB.CategoryNameMap
source: html/a05f4795-6226-3ea2-f42b-3aa95527cbd1.htm
---
# CategoryNameMap Methods

Removes every category from the map, rendering it empty.